---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Double)
source: html/a5a4bf0b-879a-d56a-ae79-3a011464b466.htm
---
# Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute Method

Sets the attribute value.

## Syntax (C#)
```csharp
public void SetAttribute(
	string name,
	double value
)
```

## Parameters
- **name** (`System.String`) - The attribute name.
- **value** (`System.Double`) - The value.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null